In [15]:
# !pip install pandas numpy sqlalchemy pymysql cryptography

In [2]:
import pandas as pd

In [3]:
paddy_df = pd.read_csv('../data/raw/paddy_2011_2025.csv')
rice_parboiled_df = pd.read_csv('../data/raw/rice_parboiled_2011_2025.csv')
rice_raw_df = pd.read_csv('../data/raw/rice_raw_2011_2025.csv')
wheat_df = pd.read_csv('../data/raw/wheat_2011_2025.csv')

In [4]:
paddy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64968 entries, 0 to 64967
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Commodity_Id     64968 non-null  int64
 1   Total_stock      64968 non-null  float64
 2   Commodity_Stock  64968 non-null  float64
 3   Code             64968 non-null  object
 4   Date             64968 non-null  object
 5   Individual_Date  64968 non-null  int64
 6   District_name    64968 non-null  object
 7   Month            64968 non-null  int64
 8   Year             64968 non-null  int64
 9   Commodity_name   64968 non-null  object
 10  District_code    64968 non-null  object
 11  Stock            64968 non-null  float64
dtypes: float64(3), int64(4), object(5)
memory usage: 5.9+ MB

In [25]:
paddy_df.head(5)

,Commodity_Id,Total_stock,Commodity_Stock,Code,Date,Individual_Date,District_name,Month,Year,Commodity_name,District_code,Stock
0,4,65964.28929,65964.28929,Region Name: Bihar,2012-10-16,16,PURNIA,10,2012,Paddy,EC16,4368.47100
1,4,65964.28929,65964.28929,Region Name: Bihar,2012-10-16,16,PATNA,10,2012,Paddy,EC17,660.05494
2,4,65876.78929,65876.78929,Region Name: Bihar,2012-10-17,17,GAYA,10,2012,Paddy,EC14,5165.01200
3,4,65876.78929,65876.78929,Region Name: Bihar,2012-10-17,17,PURNIA,10,2012,Paddy,EC16,4280.97100
4,4,65260.56929,65260.56929,Region Name: Bihar,2012-10-18,18,GAYA,10,2012,Paddy,EC14,4636.29200

In [19]:
rice_parboiled_df.head(5)

,Commodity_Id,Total_stock,Commodity_Stock,Code,Date,Individual_Date,District_name,Month,Year,Commodity_name,District_code,Stock
0,3,66307.26000,66307.26000,Region Name: Maharastra,2011-04-27,27,NAGPUR,4,2011,Rice-Parboiled,WC17,66307.26000
1,3,67116.70000,67116.70000,Region Name: Maharastra,2011-04-30,30,NAGPUR,4,2011,Rice-Parboiled,WC17,67116.70000
2,3,418651.83524,418651.83524,Region Name: Bihar,2011-08-24,24,SAHRSA,8,2011,Rice-Parboiled,EC21,25192.37482
3,3,412558.99844,412558.99844,Region Name: Bihar,2011-08-25,25,BHAGALPUR,8,2011,Rice-Parboiled,EC12,18915.58527
4,3,412558.99844,412558.99844,Region Name: Bihar,2011-08-25,25,PURNIA,8,2011,Rice-Parboiled,EC16,29192.87284

In [20]:
rice_raw_df.head(5)

,Commodity_Id,Total_stock,Commodity_Stock,Code,Date,Individual_Date,District_name,Month,Year,Commodity_name,District_code,Stock
0,2,634094.49495,634094.49495,Region Name: Orissa,2015-03-15,15,BALASORE,3,2015,Rice-Raw,EE12,1079.31000
1,2,634094.49495,634094.49495,Region Name: Orissa,2015-03-15,15,CUTTACK,3,2015,Rice-Raw,EE14,1619.45400
2,2,634094.49495,634094.49495,Region Name: Orissa,2015-03-15,15,JAYPORE,3,2015,Rice-Raw,EE15,192991.94310
3,2,680123.32310,680123.32310,Region Name: Orissa,2015-03-17,17,TITLAGARH,3,2015,Rice-Raw,EE17,127986.76785
4,2,683656.85295,683656.85295,Region Name: Orissa,2015-03-18,18,BALASORE,3,2015,Rice-Raw,EE12,1348.81000

In [21]:
wheat_df.head(5)

,Commodity_Id,Total_stock,Commodity_Stock,Code,Date,Individual_Date,District_name,Month,Year,Commodity_name,District_code,Stock
0,1,1.146531e+06,1.146531e+06,Region Name: Kerala,2015-05-18,18,ALLEPPY,5,2015,Wheat(Including URS),SC12,115403.91711
1,1,1.146531e+06,1.146531e+06,Region Name: Kerala,2015-05-18,18,MAZAHAPPOALANGAD,5,2015,Wheat(Including URS),SC16,45653.18308
2,1,1.136569e+06,1.136569e+06,Region Name: Kerala,2015-05-19,19,COCHIN,5,2015,Wheat(Including URS),SC14,49417.39294
3,1,1.136569e+06,1.136569e+06,Region Name: Kerala,2015-05-19,19,KOTTYAM,5,2015,Wheat(Including URS),SC15,50445.83920
4,1,1.136569e+06,1.136569e+06,Region Name: Kerala,2015-05-19,19,MAZAHAPPOALANGAD,5,2015,Wheat(Including URS),SC16,45653.18308

In [ ]:
# Connecting to MySQL
from sqlalchemy import create_engine

username = "pyuser"
password = "py_password"
host = "localhost"
port = "3306"
database = "foodgrain_stocks"

engine = create_engine(
    f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}"
)

# Loading Dataframe into MySQL
table_name = "paddy_raw"
paddy_df.to_sql(table_name, engine, index=False)

print(f"Data successfully loaded into table '{table_name}' in database '{database}'.")

table_name = "rice_parboiled_raw"
rice_parboiled_df.to_sql(table_name, engine, index=False)

print(f"Data successfully loaded into table '{table_name}' in database '{database}'.")

table_name = "rice_raw_raw"
rice_raw_df.to_sql(table_name, engine, index=False)

print(f"Data successfully loaded into table '{table_name}' in database '{database}'.")

table_name = "wheat_raw"
wheat_df.to_sql(table_name, engine, index=False)

print(f"Data successfully loaded into table '{table_name}' in database '{database}'.")

Data successfully loaded into table 'paddy_raw' in database 'foodgrain_stocks'.
Data successfully loaded into table 'rice_parboiled_raw' in database 'foodgrain_stocks'.
Data successfully loaded into table 'rice_raw_raw' in database 'foodgrain_stocks'.
Data successfully loaded into table 'wheat_raw' in database 'foodgrain_stocks'.